In [42]:
import pandas as pd
import numpy as np


dates = pd.date_range("20250101", periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2025-01-01 -0.320128 -1.174109  0.226807  0.916762
2025-01-02 -0.757612  0.791371 -0.398763 -1.060887
2025-01-03 -0.824090 -0.511559 -0.469109 -0.440997
2025-01-04  1.113277 -0.891936 -1.017775  0.346019
2025-01-05  0.017218 -0.563936  0.590667 -0.628518
2025-01-06  0.049936  0.224378  0.531385  0.053041

In [43]:
df1 = df.reindex(index=dates[0: 4], columns=list(df.columns) + ['E'])
df1.iloc[0:2,4] = 1
df1

                   A         B         C         D    E
2025-01-01 -0.320128 -1.174109  0.226807  0.916762  1.0
2025-01-02 -0.757612  0.791371 -0.398763 -1.060887  1.0
2025-01-03 -0.824090 -0.511559 -0.469109 -0.440997  NaN
2025-01-04  1.113277 -0.891936 -1.017775  0.346019  NaN

In [44]:
df1.dropna()

                   A         B         C         D    E
2025-01-01 -0.320128 -1.174109  0.226807  0.916762  1.0
2025-01-02 -0.757612  0.791371 -0.398763 -1.060887  1.0

In [45]:
df1.fillna(5)

                   A         B         C         D    E
2025-01-01 -0.320128 -1.174109  0.226807  0.916762  1.0
2025-01-02 -0.757612  0.791371 -0.398763 -1.060887  1.0
2025-01-03 -0.824090 -0.511559 -0.469109 -0.440997  5.0
2025-01-04  1.113277 -0.891936 -1.017775  0.346019  5.0

In [46]:
s = pd.Series([1, 3, 1, np.nan, 6, 8], index=dates).shift(2)
s

2025-01-01    NaN
2025-01-02    NaN
2025-01-03    1.0
2025-01-04    3.0
2025-01-05    1.0
2025-01-06    NaN
Freq: D, dtype: float64

In [47]:
df

                   A         B         C         D
2025-01-01 -0.320128 -1.174109  0.226807  0.916762
2025-01-02 -0.757612  0.791371 -0.398763 -1.060887
2025-01-03 -0.824090 -0.511559 -0.469109 -0.440997
2025-01-04  1.113277 -0.891936 -1.017775  0.346019
2025-01-05  0.017218 -0.563936  0.590667 -0.628518
2025-01-06  0.049936  0.224378  0.531385  0.053041

In [48]:
df.sub(s, axis="index")

                   A         B         C         D
2025-01-01       NaN       NaN       NaN       NaN
2025-01-02       NaN       NaN       NaN       NaN
2025-01-03 -1.824090 -1.511559 -1.469109 -1.440997
2025-01-04 -1.886723 -3.891936 -4.017775 -2.653981
2025-01-05 -0.982782 -1.563936 -0.409333 -1.628518
2025-01-06       NaN       NaN       NaN       NaN

In [49]:
df

                   A         B         C         D
2025-01-01 -0.320128 -1.174109  0.226807  0.916762
2025-01-02 -0.757612  0.791371 -0.398763 -1.060887
2025-01-03 -0.824090 -0.511559 -0.469109 -0.440997
2025-01-04  1.113277 -0.891936 -1.017775  0.346019
2025-01-05  0.017218 -0.563936  0.590667 -0.628518
2025-01-06  0.049936  0.224378  0.531385  0.053041

In [50]:
df.A.transform(lambda x: x*100)

2025-01-01    -32.012750
2025-01-02    -75.761187
2025-01-03    -82.408986
2025-01-04    111.327720
2025-01-05      1.721757
2025-01-06      4.993553
Freq: D, Name: A, dtype: float64

In [51]:
df.agg(lambda x: np.mean(x) * 100)

A   -12.023316
B   -35.429879
C    -8.946463
D   -13.576344
dtype: float64

In [52]:
pd.concat([df, df]).value_counts()

A          B          C          D
-0.824090  -0.511559  -0.469109  -0.440997    2
-0.757612   0.791371  -0.398763  -1.060887    2
-0.320128  -1.174109   0.226807   0.916762    2
 0.017218  -0.563936   0.590667  -0.628518    2
 0.049936   0.224378   0.531385   0.053041    2
 1.113277  -0.891936  -1.017775   0.346019    2
Name: count, dtype: int64

In [53]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [54]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [55]:
df1 = df.copy(deep=True)
df1.columns = df.columns.str.lower()
df1

                   a         b         c         d
2025-01-01 -0.320128 -1.174109  0.226807  0.916762
2025-01-02 -0.757612  0.791371 -0.398763 -1.060887
2025-01-03 -0.824090 -0.511559 -0.469109 -0.440997
2025-01-04  1.113277 -0.891936 -1.017775  0.346019
2025-01-05  0.017218 -0.563936  0.590667 -0.628518
2025-01-06  0.049936  0.224378  0.531385  0.053041

In [56]:
df.join(df1)

,A,B,C,D,a,b,c,d
2025-01-01,-0.320128,-1.174109,0.226807,0.916762,-0.320128,-1.174109,0.226807,0.916762
2025-01-02,-0.757612,0.791371,-0.398763,-1.060887,-0.757612,0.791371,-0.398763,-1.060887
2025-01-03,-0.824090,-0.511559,-0.469109,-0.440997,-0.824090,-0.511559,-0.469109,-0.440997
2025-01-04,1.113277,-0.891936,-1.017775,0.346019,1.113277,-0.891936,-1.017775,0.346019
2025-01-05,0.017218,-0.563936,0.590667,-0.628518,0.017218,-0.563936,0.590667,-0.628518
2025-01-06,0.049936,0.224378,0.531385,0.053041,0.049936,0.224378,0.531385,0.053041

In [57]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})

left.merge(right, on='key', how='inner')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [58]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],"k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [59]:
data[~data.k1.duplicated()]

    k1  k2
0  one   1
1  two   1

In [60]:
data.drop_duplicates('k1', keep='last')

    k1  k2
4  one   3
6  two   4

In [61]:
class Solution:
    def maxSubArray(self, nums: list[int]) -> int:
        res = float('-inf')
        curr = 0
        for n in nums:
            curr = max(0, curr+n)
            curr += n
            res = max(curr, res)
        
        return res

In [62]:
s = pd.Series(['a', 'b', 'c', 'd'] * 2)
cat_s = s.astype('category')
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [63]:
cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [64]:
data = pd.Series(np.random.uniform(size=9), index=[["a", "a", "a", "b", "b", "c", "c", "d", "d"],  [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    0.736301
   2    0.217982
   3    0.502264
b  1    0.215019
   3    0.580849
c  1    0.197035
   2    0.130548
d  2    0.609048
   3    0.742712
dtype: float64

In [65]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [66]:
data.b

1    0.215019
3    0.580849
dtype: float64

In [67]:
data

a  1    0.736301
   2    0.217982
   3    0.502264
b  1    0.215019
   3    0.580849
c  1    0.197035
   2    0.130548
d  2    0.609048
   3    0.742712
dtype: float64

In [68]:
data.unstack()

          1         2         3
a  0.736301  0.217982  0.502264
b  0.215019       NaN  0.580849
c  0.197035  0.130548       NaN
d       NaN  0.609048  0.742712

In [69]:
df1 = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"], "data1": pd.Series(range(6), dtype="Int64")})

df2 = pd.DataFrame({"key": ["a", "b", "a", "b", "d"], "data2": pd.Series(range(5), dtype="Int64")})

df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [70]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [71]:
df1.merge(df2)

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   a      2      0
5   a      2      2
6   a      4      0
7   a      4      2
8   b      5      1
9   b      5      3

In [72]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   a      2      0
5   a      2      2
6   a      4      0
7   a      4      2
8   b      5      1
9   b      5      3

In [73]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [74]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [75]:
df1.set_index('key').join(df2.set_index('key'))

     data1  data2
key
b        0      1
b        0      3
b        1      1
b        1      3
a        2      0
a        2      2
c        3   <NA>
a        4      0
a        4      2
b        5      1
b        5      3

In [79]:
df['day'] = ['m','t','w']*2
df

                   A         B         C         D day
2025-01-01 -0.320128 -1.174109  0.226807  0.916762   m
2025-01-02 -0.757612  0.791371 -0.398763 -1.060887   t
2025-01-03 -0.824090 -0.511559 -0.469109 -0.440997   w
2025-01-04  1.113277 -0.891936 -1.017775  0.346019   m
2025-01-05  0.017218 -0.563936  0.590667 -0.628518   t
2025-01-06  0.049936  0.224378  0.531385  0.053041   w

In [83]:
df.groupby('day')[['A', 'B']].agg([ ('avg', 'mean'), ('std', np.std) ])

C:\Users\Utsav\AppData\Local\Temp\ipykernel_21808\1519244694.py:1: FutureWarning: The provided callable <function std at 0x0000017DE9A904A0> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  df.groupby('day')[['A', 'B']].agg([ ('avg', 'mean'), ('std', np.std) ])

            A                   B
          avg       std       avg       std
day
m    0.396575  1.013570 -1.033023  0.199526
t   -0.370197  0.547887  0.113717  0.958347
w   -0.387077  0.618029 -0.143591  0.520386

In [85]:
df.groupby('day')[['A', 'B']].agg({'A':'mean', 'B': 'std'})

            A         B
day
m    0.396575  0.199526
t   -0.370197  0.958347
w   -0.387077  0.520386

In [90]:
df.groupby('day', as_index=False)[['A', 'B']].describe()

  day     A                                                              \
      count      mean       std       min       25%       50%       75%
0   m   2.0  0.396575  1.013570 -0.320128  0.038224  0.396575  0.754926
1   t   2.0 -0.370197  0.547887 -0.757612 -0.563905 -0.370197 -0.176490
2   w   2.0 -0.387077  0.618029 -0.824090 -0.605584 -0.387077 -0.168571

                B                                                              \
        max count      mean       std       min       25%       50%       75%
0  1.113277   2.0 -1.033023  0.199526 -1.174109 -1.103566 -1.033023 -0.962480
1  0.017218   2.0  0.113717  0.958347 -0.563936 -0.225110  0.113717  0.452544
2  0.049936   2.0 -0.143591  0.520386 -0.511559 -0.327575 -0.143591  0.040393


        max
0 -0.891936
1  0.791371
2  0.224378

In [92]:
df = pd.DataFrame({
    'stock': ['a', 'a', 'a', 'b', 'c','c'],
    'px': [100, 101, 101.1, 10, 11, 12]
})

df

  stock     px
0     a  100.0
1     a  101.0
2     a  101.1
3     b   10.0
4     c   11.0
5     c   12.0

In [101]:
result = df.groupby('stock', as_index=False)['px'].pct_change().dropna()
df.loc[result.index, ['stock', 'px']].assign(pct_change=result.values)

  stock     px  pct_change
1     a  101.0    0.010000
2     a  101.1    0.000990
5     c   12.0    0.090909

In [103]:
df.groupby('stock')[['px']].apply('mean')

          px
stock
a      100.7
b       10.0
c       11.5

In [104]:
df.groupby('stock')[['px']].transform('mean')

      px
0  100.7
1  100.7
2  100.7
3   10.0
4   11.5
5   11.5